src/test/resources/wire-tests/BankTransferPaymentsRefundsWireTest_testReverseRefund_response.json

{
  "refundId": "CD3HN88U9F",
  "processingTerminalId": "1234001",
  "order": {
    "orderId": "OrderRef6543",
    "dateTime": "2024-07-02T15:30:00Z",
    "description": "Refund for order OrderRef6543",
    "amount": 4999,
    "currency": "USD"
  },
  "customer": {
    "notificationLanguage": "en",
    "contactMethods": [
      {
        "value": "jane.doe@example.com",
        "type": "email"
      }
    ]
  },
  "bankAccount": {
    "secCode": "web",
    "nameOnAccount": "Sarah Hazel Hopper",
    "accountNumber": "123456789",
    "routingNumber": "123456789",
    "secureToken": {
      "secureTokenId": "MREF_abc1de23-f4a5-6789-bcd0-12e345678901fa",
      "customerName": "Sarah Hazel Hopper",
      "token": "296753123456",
      "status": "notValidated",
      "link": {
        "rel": "previous",
        "method": "get",
        "href": "<uri>"
      }
    },
    "type": "ach"
  },
  "payment": {
    "paymentId": "M2MJOG6O2Y",
    "dateTime": "2024-07-02T15:30:00Z",
    "currency": "AED",
    "amount": 4999,
    "status": "ready",
    "responseCode": "A",
    "responseMessage": "Transaction approved",
    "link": {
      "rel": "previous",
      "method": "get",
      "href": "<uri>"
    }
  },
  "transactionResult": {
    "type": "unreferencedRefund",
    "status": "reversal",
    "authorizedAmount": -4999,
    "currency": "USD",
    "responseCode": "A",
    "responseMessage": "NoError",
    "processorResponseCode": "0"
  },
  "customFields": [
    {
      "name": "yourCustomField",
      "value": "abc123"
    }
  ]
}